#### Terraform Workspace 🛠️`vglab`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-vglab/runs/run-8N1jrbLiFqS29yQa

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
openstack_networking_secgroup_v2.bastion: Refreshing state... [id=6e1c0d2e-c818-4735-aadf-127f533dfc59]
openstack_compute_keypair_v2.bastion: Refreshing state... [id=vglab-bastion]
openstack_networking_secgroup_rule_v2.icmp: Refreshing state... [id=dc2a947f-4b6b-40f6-a51d-33fd4bdf7f49]
openstack_networking_secgroup_rule_v2.ssh: Refreshing state... [id=f90475f7-3c2e-4cb4-906c-2e87fb813e8b]
openstack_networking_secgroup_rule_v2.mosh: Refreshing state... [id=36836f04-62c2-4716-ad34-e8ab415a5b7b]
openstack_networking_port_v2.bastion: Refreshing state... [id=8bc7762a-e03a-4a74-9957-991df8c0c412]
openstack_networking_floatingip_associate_v2.bastion: Refreshing state... [id=7d641e84-dd18-4d58-b777-d5b30f54b30f]
openstack_compute_instance_v2.bastion: Refreshing state... [id=76e12a5b-22d0-46bb-b954-b0bb92b3649a]
null_resource.users["pierre"]: Refreshing state... [id=6649133195041874690]
null_resource.users["matt"]: Refreshing state... [id=1514580364737099116]
null_resource.sudoers["piotr"]: Refreshing state... [id=6739102794926897133]
null_resource.mosh: Refreshing state... [id=1974812946136221044]
null_resource.host-key: Refreshing state... [id=7762579978089870422]
null_resource.users["isaac"]: Refreshing state... [id=6153236312780116911]
null_resource.users["mark"]: Refreshing state... [id=2539675577592055774]
null_resource.unattended-upgrades: Refreshing state... [id=3111176607412775709]
null_resource.users["piotr"]: Refreshing state... [id=6122047361611860101]
null_resource.users["will"]: Refreshing state... [id=6831096314685544973]
null_resource.users["bartosz"]: Refreshing state... [id=401793357183687053]
null_resource.users["steveb"]: Refreshing state... [id=2385931389615733411]
null_resource.users["michal"]: Refreshing state... [id=2355262619663827921]
null_resource.users["stig"]: Refreshing state... [id=8680413725333778501]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_compute_keypair_v2.bastion has been deleted
  - resource "openstack_compute_keypair_v2" "bastion" {
      - fingerprint = "d9:c9:3a:f7:25:33:52:0a:3e:12:61:ad:ce:44:1e:14" -> null
      - id          = "vglab-bastion" -> null
      - name        = "vglab-bastion" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDFG04bDnzPQwrzbnxFmezrFvzcQkbWTO7w578S51Q7gbHjyN77s9J3JAwNqvVfoKuGdf9YDnMbowhOdmmdWuWLb9qY88rdfb605bC0k6aQg42FZ9L4ucuVU7qhoHRso2Rxos658SvG2Eba+3gIypIRG1ySBjLw5NJDLTIrtMOkkuf7EmitkkQCb33Men3O2mjTcNkb4DLsw2mHkmkUNhflqrzFhNGZvqCUOBkRodqXR0zGdyX3FXrc6MjdvL1RvIlFOUwH6jnBNXDsTNwrS47rhXTq8cCeROs4QMdEpRJqKKXrY1d5Ph81MwRp9cUoJ1JnwgpcFyl8K3Q++UYAdDQL" -> null
      - region      = "RegionOne" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.host-key must be replaced
-/+ resource "null_resource" "host-key" {
      ~ id       = "7762579978089870422" -> (known after apply)
      ~ triggers = {
          - "host"        = "185.45.78.150"
          - "host_keys"   = (sensitive)
          - "instance"    = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.mosh must be replaced
-/+ resource "null_resource" "mosh" {
      ~ id       = "1974812946136221044" -> (known after apply)
      ~ triggers = {
          - "host"        = "185.45.78.150"
          - "instance"    = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.sudoers["piotr"] must be replaced
-/+ resource "null_resource" "sudoers" {
      ~ id       = "6739102794926897133" -> (known after apply)
      ~ triggers = {
          - "host"        = "185.45.78.150"
          - "instance"    = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.unattended-upgrades must be replaced
-/+ resource "null_resource" "unattended-upgrades" {
      ~ id       = "3111176607412775709" -> (known after apply)
      ~ triggers = {
          - "host"        = "185.45.78.150"
          - "instance"    = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key" = (sensitive)
          - "user"        = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["bartosz"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "401793357183687053" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIM1iGZ6wblHvuShGuP3yzhoa5ME069yYE2jPFEOAPttC bartosz@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["darmach"] will be created
  + resource "null_resource" "users" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # null_resource.users["isaac"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6153236312780116911" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIM1y8M+f9AQll1yGTJspJBLMSXklT4ktzl4ccMOMf3iR isaac@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["mark"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2539675577592055774" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJXNGOmsnRcZdmjMA5f3fgq8l8+QMjBywJQzuvxlhslx mark@mark-xps15
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["matt"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "1514580364737099116" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJa0D+EVJkKo6NDnw23+W23tkKr4MPZQxn0+guCXKCT1 matt@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["michal"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2355262619663827921" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICY4CwVM472QS5TYhEwAHge4vbkuBtpVUCC8cyIolYR5 michal@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["pierre"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6649133195041874690" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATVu5COwRn9FirPl2GhQIY/RmZkNGM+CcXOhT7WujBf priteau@raider.home
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["piotr"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6122047361611860101" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHK1Kf1hRYskYfYtXnqnyzD6vFbpKVyUtcxcn2pYL2y+ piotr@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["steveb"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2385931389615733411" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDuNoaIV5Nw4HGblhFg6BOTpSlO+QZWxsZOtiaxR71CcP85+Sk8LQUY45L6gtO6n3swTLvkI96nTEQWjY7Cw2Z5WirO8Jctm0dYFtqU17jSkrgQymF7rHy/JCOVoIyLBlt/TJuTU5IRhw3Sd6HjAqvYstAV+8Bd1UWkzFQK/gUGx3SaqyWvKcINmSmszdS7+ZM/07Y9vXPW4MiJzWHQl1yqCEQ+QUttuYOxbNaHAwb9JOPgzsBnSFHW4skpCYKl4nsssE4um68Da7V0YFumwWXc/T6PBqwdMf2E2Ix/dFympzZGJA86mZFN6+NB2vvxKV7eY6BkKbbsinzQlCQT78AT steveb@DESKTOP-NSUK66K(base)
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["stig"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "8680413725333778501" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnj2Ie2DACWi25spQ5wr6dJEthiuUGyUQSOI88ehVZc stig@columba.local
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["will"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "6831096314685544973" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCecNnBo+YV/P4QIgZtFbZVy5nPpz3w3agMfv8a2fGMNGo0DZkAIli2enl8fo7swyOF7Kic5gl7XXv3urURMaiLfWSmLdrAw9p5R6LXmTTo6JHYd/Go9KtA++6S5iY9z1UQrgJwKimxjNyC67KplKIWOy/en6FzJ1HboNKEsZtrFzSc/VSKeJRBMM/dHNH/fQKKGwXbwyVuPT/mY+DBC67VQKZgg/Z8Q/GvK5Ux6gI07ixQxC48O9JB440EW/MxCfUqbDJ3uqB2jsnp4CpcBPHiSQ1YW2yAwQMij8/18DhouiP7i/4WPy1Z4FeQddU1sSNsrd1xv5j/ErPuDkW9zzr+lnlxI8RdR0e8ZIR79P883De/EbD7x9NyJjBl/0ObDtDzHaIf7MFgkqU32czKRo82+0FYT4Mh/lRZ5KrMjjuMDMA24/OLHrqBHQM3dSHnTKjHQmzia9oJDSs35haE2lPldU8SCQvB8W+N6wpPoDQcR5YDGHn1ugw/WM1+yKle2TE= will@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "76e12a5b-22d0-46bb-b954-b0bb92b3649a"
          - "private_key"     = (sensitive)
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # openstack_compute_instance_v2.bastion must be replaced
-/+ resource "openstack_compute_instance_v2" "bastion" {
      ~ access_ip_v4        = "10.0.1.185" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "general.v1.small" -> (known after apply)
      ~ id                  = "76e12a5b-22d0-46bb-b954-b0bb92b3649a" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04" -> (known after apply)
      ~ key_pair            = "vglab-bastion" -> (known after apply) # forces replacement
        name                = "vglab-bastion"
      ~ region              = "RegionOne" -> (known after apply)
      ~ security_groups     = [
          - "vglab-bastion",
        ] -> (known after apply)
      - tags                = [] -> null
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.0.1.185" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:18:64:a1" -> (known after apply)
          ~ name           = "stackhpc-ipv4-geneve" -> (known after apply)
          ~ uuid           = "26023e3d-bc8e-459c-8def-dbd47ab01756" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_compute_keypair_v2.bastion will be created
  + resource "openstack_compute_keypair_v2" "bastion" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "vglab-bastion"
      + private_key = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDFG04bDnzPQwrzbnxFmezrFvzcQkbWTO7w578S51Q7gbHjyN77s9J3JAwNqvVfoKuGdf9YDnMbowhOdmmdWuWLb9qY88rdfb605bC0k6aQg42FZ9L4ucuVU7qhoHRso2Rxos658SvG2Eba+3gIypIRG1ySBjLw5NJDLTIrtMOkkuf7EmitkkQCb33Men3O2mjTcNkb4DLsw2mHkmkUNhflqrzFhNGZvqCUOBkRodqXR0zGdyX3FXrc6MjdvL1RvIlFOUwH6jnBNXDsTNwrS47rhXTq8cCeROs4QMdEpRJqKKXrY1d5Ph81MwRp9cUoJ1JnwgpcFyl8K3Q++UYAdDQL"
      + region      = (known after apply)
    }

Plan: 17 to add, 0 to change, 15 to destroy.

Changes to Outputs:
  ~ users = [
      + "darmach",
        # (10 unchanged elements hidden)
    ]
```

</details>

#### Author ✍️@bbezak